Revit 2022 API
Schema Members
The Schema type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Schema
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
EraseSchemaAndAllEntities |  Obsolete.
 Erases all Entities corresponding to this Schema from all open documents, and erases this Schema from memory.
GetField
 Gets a Field of a given name from the Schema.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ListFields
 The complete list of fields in the Schema, sorted by name.
ListSchemas
 Lists all schemas in memory.
Lookup
 Finds the Schema corresponding to the GUID in memory.
ReadAccessGranted
 Checks whether Entities of this Schema may be retrieved by the current add-in.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
WriteAccessGranted
 Checks whether Entities of this Schema may be stored by the current add-in.
Properties
Name | Description
ApplicationGUID
 The GUID of the application or add-in that may access entities of this Schema under the Application access level.
Documentation
 The overall description of the Schema.
GUID
 The identifier of the Schema. Setter made unavailable, because it would violate set-correctness
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ReadAccessLevel
 Read access level of the schema.
SchemaName
 The user-friendly name of the Schema.
VendorId
 The id of the third-party vendor that may access entities of this Schema under the Vendor access level.
WriteAccessLevel
 Write access level of the schema.
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace